In [7]:
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
engine = create_engine('postgresql://postgres:PostGresPasscode@localhost/2020Homelessness')
connection = engine.connect()

In [8]:
homelessness_unemployment=pd.read_sql("SELECT * FROM homelessness", connection)
homelessness_unemployment.head()

,state_id,state,unemployment_rate,under_18,age_18_to_24,age_24_and_over,female,male,transgender,overall_homeless
0,0,Alaska,7.8,326,197,"1,426",828,"1,114",3,"1,949"
1,1,Alabama,5.9,528,198,"2,625","1,294","1,988",9,"3,351"
2,2,Arkansas,6.1,195,258,"1,913",798,"1,561",5,"2,366"
3,3,Arizona,7.9,"1,722",824,"8,433","4,228","6,694",43,"10,979"
4,4,California,10.1,"16,141","13,391","132,016","53,505","105,737","1,601","161,548"